package softing.ubah4ukdev.moviesinfosearcher.domain

import android.os.Handler
import android.os.Looper
import java.util.concurrent.Executor
import java.util.concurrent.Executors
import kotlin.random.Random

/****
Project Movies info searcher
Package softing.ubah4ukdev.moviesinfosearcher.domain

Created by Ivan Sheynmaer

2021.05.03
v1.0
 */
//Временная реализация репозитория с заданными списками фильмов заранее
object MockMoviesRepositoryImpl : IMovieRepository {
    private const val DELAY_RESPONSE_ONE = 2500L
    private const val DELAY_RESPONSE_TWO = 3500L

    private val executor: Executor = Executors.newCachedThreadPool()

    private val mainThreadHandler = Handler(Looper.getMainLooper())

    private var movies: ArrayList<Movie> = ArrayList<Movie>()

    init {
        movies = arrayListOf(
            Movie(
                460465,
                "Мортал Комбат",
                "2021-04-07",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/b1jxegUWWwAwfGTV780wxwtwmQF.jpg",
                "https://image.tmdb.org/t/p/w780/9yBVqNruk6Ykrwc32qrK2TIE5xw.jpg",
                "Боец смешанных единоборств Коул Янг не раз соглашался проиграть за деньги. Он не знает о своем наследии и почему император Внешнего Мира Шан Цзун посылает своего лучшего воина, могущественного криомансера Саб-Зиро, на охоту за Коулом. Янг боится за безопасность своей семьи, и майор спецназа Джакс, обладатель такой же отметки в виде дракона, как и у Коула, советует ему отправиться на поиски Сони Блейд. Вскоре он оказывается в храме Лорда Рейдена, Старшего Бога и защитника Земного Царства, который дает убежище тем, кто носит метку. Здесь Коул тренируется с опытными воинами Лю Каном, Кун Лао и наемником-изгоем Кано, готовясь вместе с величайшими чемпионами Земли противостоять врагам из Внешнего Мира в битве за вселенную. Но сможет ли Коул приложить все усилия и раскрыть в себе аркану — могущественную силу его души, чтобы не только спасти свою семью, но и остановить Внешний Мир раз и навсегда?",
                1
            ),
            Movie(
                399566,
                "Годзилла против Конга\"",
                "2021-03-24",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/w6s3yQIMKMc6cmtdEtBkkGCA3V1.jpg",
                "https://image.tmdb.org/t/p/w780/inJjDhCjfhh3RtrJWBmmDqeuSYC.jpg",
                "Конг и группа ученых отправляются в опасное путешествие в поисках родного дома гиганта. Среди них девочка Джия, единственная, кто умеет общаться с Конгом. Неожиданно они сталкиваются с разъяренным Годзиллой, разрушающим все на своем пути. Битва двух титанов, спровоцированная неведомыми силами — лишь малая часть тайны, спрятанной в недрах Земли.",
                1
            ),
            Movie(
                804435,
                "Ангел мести",
                "2021-04-16",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/7RAgd1wPhLIXt9WlOaCxLrzf7k1.jpg",
                "https://image.tmdb.org/t/p/w780/mb3fcmQzXd8aUf7r6izZfMHSJmz.jpg",
                "После выхода на пенсию бывший комиссар полиции понял, что прикрывать продажных детективов было ошибкой. Но чтобы подчистить за собой город, он выбирает не самый гуманный способ. Похитив невинного ребенка, он шантажирует его мать. В попытке спасти дочь женщина становится орудием в войне против разбушевавшегося криминала. Впрочем, теперь ее гнева хватит не только на преступников.",
                1
            ),
            Movie(
                635302,
                "Истребитель демонов: Поезд «Бесконечный»",
                "2020-10-16",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/sYoduof7H9nI1f8nBTdR2j7DCyt.jpg",
                "https://image.tmdb.org/t/p/w780/3FVe3OAdgz060JaxIAaUl5lo6cx.jpg",
                "Тандзиро с друзьями из отряда уничтожителей демонов расследует серию загадочных исчезновений внутри мчащегося поезда. Но компания ещё не знает, что в составе находится один из двенадцати Лунных демонов, и он приготовил для них ловушку.",
                1
            ),
            Movie(
                615457,
                "Никто",
                "2021-03-26",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/h3zs8tu6OG37xqo8QlcgwgjLE0y.jpg",
                "https://image.tmdb.org/t/p/w780/6zbKgwgaaCyyBXE4Sun4oWQfQmi.jpg",
                "Непримечательный и незаметный человек живёт обычной жизнью, пока однажды, спасая женщину от нападения бандитов, не отправляет одного из хулиганов в больницу. Лишь позже он узнаёт, что это был брат влиятельного гангстера, который теперь жаждет мести.",
                1
            ),
            Movie(
                385128,
                "Форсаж 9",
                "2021-05-19",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/tx5vLuGQqUhjgxJrUh513HaUur2.jpg",
                "https://image.tmdb.org/t/p/w780/xXHZeb1yhJvnSHPzZDqee0zfMb6.jpg",
                "Времена меняются: Доминик Торетто залегает на дно и живет спокойной жизнью с семьей. Но судьба имеет на него другие планы.",
                2
            ),
            Movie(
                520763,
                "Тихое место 2",
                "2021-05-27",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2//r9DjNUi9y45satAsgvSaioAXz64.jpg",
                "https://image.tmdb.org/t/p/w780//z2UtGA1WggESspi6KOXeo66lvLx.jpg",
                "Семья Эбботт продолжает бороться за жизнь в полной тишине. Вслед за смертельной угрозой, с которой они столкнулись в собственном доме, им предстоит познать ужасы внешнего мира. Они вынуждены отправиться в неизвестность, где быстро обнаруживают, что существа, охотящиеся на звук, — не единственные враги за пределами безопасной песчаной тропы.",
                2
            ),
            Movie(
                600354,
                "Отец",
                "2020-12-23",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/l9iHbA887CAzmxK3NL5U1nHPndP.jpg",
                "https://image.tmdb.org/t/p/w780/h3weAFgg06GqchI2xDfufBgSFTj.jpg",
                "Энтони далеко не молод и живет один в Лондоне, что очень тревожит его дочь. Она не хочет оставлять отца без присмотра и пытается найти ему сиделку. Энтони отметает все предложенные варианты. Однако, планируя переезд в Париж, дочь не спешит сдаваться. Она становится все настойчивее в попытках найти для упрямого папочки идеальную женщину.",
                2
            ),
            Movie(
                486589,
                "Красные туфельки и семь гномов",
                "2019-07-25",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/nN4Gs3vZAOJ1D6FRtrwbU9VGYwU.jpg",
                "https://image.tmdb.org/t/p/w780/7porHcTZYYOC7433249nrmCdti6.jpg",
                "Анимационный фильм рассказывает о семи самовлюбленных принцах-красавцах, на которых было наложено заклятие, превратившее их в семерых уродливых гномов. Чтобы снять проклятье, они должны разыскать пару магических красных туфелек, которые носит одна девушка. Туфли помогают девушке выглядеть стройнее, чем она есть на самом деле.",
                2
            ),
            Movie(
                337404,
                "Круэлла",
                "2021-05-26",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/nuBzkLid7XWa4feBZv75c7bHJ43.jpg",
                "https://image.tmdb.org/t/p/w780/nSrc9olOYrUUTmSRsQIHRBXEPV1.jpg",
                "История о коварной злодейке Круэлле де Вил, которая обожает всё чёрно-белое и мечтает сделать шубу из шкурок далматинцев.",
                2
            ),
            Movie(
                647302,
                "Benny Loves You",
                "2021-05-07",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/mQ8vALvqA0z0qglG3gI6xpVcslo.jpg",
                "https://image.tmdb.org/t/p/w780/njxvIJjQJZJi4ihkh95pidxOJZY.jpg",
                "",
                2
            ),
            Movie(
                741228,
                "Локдаун",
                "2021-02-25",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/4qu4kO5HVTKMK2hvmCXeviZ233l.jpg",
                "https://image.tmdb.org/t/p/w780/svHelD0Hb3TXPAQoPsoBwdDMTvf.jpg",
                "История о рискованном ограблении, разворачивающемся на фоне пандемии коронавируса. Давние спарринг-партнёры Линда и Пакстон договариваются о временном перемирии, чтобы вместе совершить дерзкую кражу ювелирных изделий из самого известного лондонского универмага — Harrods.",
                2
            ),
            Movie(
                632357,
                "Нечестивые",
                "2021-03-31",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/tsKBOnrQnZU72EhiLdsBcmkbJMK.jpg",
                "https://image.tmdb.org/t/p/w780/lkInRiMtLgl9u9xE0By5hqf66K8.jpg",
                "После видения Девы Марии девушка Элис обретает способность исцеления больных. Слухи о творимых ею чудесах привлекают огромное количество людей со всех концов света. Среди них — скандальный журналист, который надеется с помощью сенсации спасти свою карьеру. Ему предстоит выяснить, является ли происходящее божественным провидением или Алисой управляют зловещие силы.",
                2
            ),
            Movie(
                412656,
                "Поступь хаоса",
                "2021-02-24",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/nKik625zZGwj7zniLH3uTgIeekC.jpg",
                "https://image.tmdb.org/t/p/w780/ovggmAOu1IbPGTQE8lg4lBasNC7.jpg",
                "2257 год. Родина Тодда Хьюитта — колонизированная планета Новый Мир, где мысли мужчин имеют визуально-звуковое воплощение и называются шумом. Парень живёт в небольшой деревне, населённой исключительно мужчинами, и ещё не научился скрывать свои мысли от окружающих. Однажды над планетой терпит крушение корабль-разведчик из второй волны колонистов, в результате чего Тодд впервые в сознательной жизни видит девушку. Местный мэр решет использовать её в своих коварных планах, но девушка сбегает, и теперь без помощи Тодда ей не обойтись.",
                2
            ),
            Movie(
                587807,
                "Том и Джерри",
                "2021-02-11",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/ro4iGRgepyi7nLfds6HGXNkSn1u.jpg",
                "https://image.tmdb.org/t/p/w780/9ns9463dwOeo1CK1JU2wirL5Yi1.jpg",
                "Кайла, работница престижного отеля, где обитает мышонок Джерри, рискующий нарушить ход дорогой свадьбы. Чтобы разобраться с грызуном, она нанимает уличного кота Тома, но решить проблему не так уж и просто.",
                2
            ),
            Movie(
                508442,
                "Душа",
                "2020-12-25",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/x4egXUupjQ8KkRzhD54fmPZuFvF.jpg",
                "https://image.tmdb.org/t/p/w780/kf456ZqeC45XTvo6W9pW5clYKfQ.jpg",
                "Уже немолодой школьный учитель музыки Джо Гарднер всю жизнь мечтал выступать на сцене в составе джазового ансамбля. Однажды он успешно проходит прослушивание у известной клубной певицы и, возвращаясь домой вне себя от счастья, падает в люк и умирает. Теперь у Джо одна дорога — в Великое После, но он сбегает с идущего в вечность эскалатора и случайно попадает в Великое До. Тут новенькие души обретают себя, и у будущих людей зарождаются увлечения, мечты и интересы. Джо становится наставником упрямой души 22, которая уже много веков не может найти свою искру и отправиться на Землю.",
                2
            ),
            Movie(
                681260,
                "Пчелка Майя: Медовый движ",
                "2021-01-07",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/nPp3rl9gI1wN55BBHiwZCagNFMG.jpg",
                "https://image.tmdb.org/t/p/w780/7HtvmsLrDeiAgDGa1W3m6senpfE.jpg",
                "Когда упрямая пчелка Майя и ее лучший друг Вилли спасают принцессу-муравьишку, начинается сказочное и опасное приключение, которое приведет их в необычные новые миры и проверит их дружбу на прочность.",
                2
            ),
            Movie(
                602734,
                "Пила: Спираль",
                "2021-05-12",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/y2rbCUSlOtd07GTWzuBkwXEcefL.jpg",
                "https://image.tmdb.org/t/p/w780/7JENyUT8ABxcvrcijDBVpdjgCY9.jpg",
                "Импульсивный детектив полиции Нью-Йорка Зик Бэнкс всю жизнь пытается вырваться из тени своего отца, прославленного ветерана правоохранительных органов. Однажды Бэнксу и его новому напарнику поручают расследование серии жестоких убийств, которые странным образом напоминают преступления прошлых лет. Так они оказываются в эпицентре зловещей игры, и цена проигрыша в ней — человеческая жизнь.",
                2
            ),
            Movie(
                556867,
                "Дать дуба в округе Юба",
                "2021-05-20",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/lwfTGgJBzDrcrtWUoRUnSjAYOgy.jpg",
                "https://image.tmdb.org/t/p/w780/k99D5W4qtLK0nuPQSSzCG9FimcD.jpg",
                "Неприметная и тихая Сью Баттонс мечтает о крупице внимания и уважения, но не получает их ни на работе, ни дома. Однажды ее муж таинственным образом исчезает. Словно услышанная Вселенной, женщина вмиг оказывается в лучах славы. Благо сестра работает на телевидении. Вот только «скелет в шкафу» Сью поднимает на уши криминальную банду округа, вдобавок к дотошным копам. Но раз вкусив интереса к своей персоне и почувствовав собственную значимость, Сью уже не может остановиться. Дальнейшая череда недопониманий и идиотических поступков рождает эффект домино, который не щадит никого.",
                2
            ),
            Movie(
                520763,
                "Тихое место 2",
                "2021-05-21",
                "https://image.tmdb.org/t/p/w185_and_h278_bestv2/r9DjNUi9y45satAsgvSaioAXz64.jpg",
                "https://image.tmdb.org/t/p/w780/z2UtGA1WggESspi6KOXeo66lvLx.jpg",
                "Семья Эбботт продолжает бороться за жизнь в полной тишине. Вслед за смертельной угрозой, с которой они столкнулись в собственном доме, им предстоит познать ужасы внешнего мира. Они вынуждены отправиться в неизвестность, где быстро обнаруживают, что существа, охотящиеся на звук, — не единственные враги за пределами безопасной песчаной тропы.",
                2
            )
        )
    }

    override fun getMoviesNowPlaying(callback: (result: RepositoryResult<ArrayList<Movie>>) -> Unit) {
        executor.execute {
            Thread.sleep(DELAY_RESPONSE_ONE)
            val isSuccessResult: Boolean = Random.nextBoolean()
            if (isSuccessResult) {
                val result: ArrayList<Movie> =
                    movies.filter { it.category == 1 } as ArrayList<Movie>
                mainThreadHandler.post {
                    callback(
                        Success(result)
                    )
                }
            } else {
                mainThreadHandler.post {
                    callback(
                        Error(Exception("Ошибка подключения. Проверьте интернет"))
                    )
                }
            }
        }
    }

    override fun getMoviesUpComing(callback: (result: RepositoryResult<ArrayList<Movie>>) -> Unit) {
        executor.execute {
            Thread.sleep(DELAY_RESPONSE_TWO)
            val isSuccessResult: Boolean = Random.nextBoolean()
            if (isSuccessResult) {
                val result: ArrayList<Movie> =
                    movies.filter { it.category == 2 } as ArrayList<Movie>

                mainThreadHandler.post {
                    callback(
                        Success(result)
                    )
                }
            } else {
                mainThreadHandler.post {
                    callback(
                        Error(Exception("Ошибка подключения. Проверьте интернет"))
                    )
                }
            }
        }
    }
}

sealed class RepositoryResult<T>
data class Success<T>(val value: T) : RepositoryResult<T>()
data class Error<T>(val value: Throwable) : RepositoryResult<T>()